app/controllers/tabflowers_controller.rb

  def index
#    @tabflowers = Tabflower.all
#     @tabflowers=Tabflower.paginate :page =>1, :per_page => 1
    @tabflowers=Tabflower.paginate :page => params[:page], :per_page => 9
---
SELECT  "tabflowers".* FROM "tabflowers" LIMIT 9 OFFSET 0

  def show
 @tabuser=session[:tabuser]
    @tabflower = Tabflower.find(params[:id])
---
SELECT  "tabflowers".* FROM "tabflowers" WHERE "tabflowers"."id" = $1 LIMIT 1  [["id", nil]]