app/controllers/tabusers_controller.rb

  def registerUser
    @new_user=Tabuser.new()
    @new_user.name=params[:tabuser][:name]
    @new_user.password=params[:tabuser][:pass]
    @new_user.true_name=params[:tabuser][:tname]
    @new_user.address=params[:tabuser][:address]
    @new_user.code=params[:tabuser][:code]
    @new_user.phone=params[:tabuser][:phone]
    @new_user.email=params[:tabuser][:email]
    @new_user.address_type=params[:tabuser][:type]
    if @new_user.save
---
INSERT INTO "tabusers" ("name", "password", "true_name", "address", "code", "phone", "email", "address_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"